clarenceliu/Mplib/Toshaba/TMPM36B/cmsis_lib/lib/src/tmpm36b_pmd.c
    /* Set MTPDxCMPU <CMPU> to specify compare value in phase U */
    PMDx->CMPU = UPhaseTiming;
    /* Set MTPDxCMPV <CMPV> to specify compare value in phase V */
    PMDx->CMPV = VPhaseTiming;
    /* Set MTPDxCMPW <CMPW> to specify compare value in phase W */
    PMDx->CMPW = WPhaseTiming;
}

/**
  * @brief  Change duty mode of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0.
  * @param  DutyMode: The duty mode of PMD.
  *   This parameter can be one of the following values:
  *   PMD_DUTY_MODE_U_PHASE, PMD_DUTY_MODE_3_PHASE.
  * @retval None.
  */
void PMD_ChangeDutyMode(TSB_MTPD_TypeDef * PMDx, uint32_t DutyMode)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_DUTY_MODE(DutyMode));
    /* Change MTPDxMDCR <DTYMD> to choose DUTY mode */
    tmp = PMDx->MDCR & PMD_MDCR_DTYMD_MASK;
    tmp |= (DutyMode << 4U);
    PMDx->MDCR = tmp;
}

/**
  * @brief  Set the specified output of the specified phase of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0.
  * @param  PMDPhase: Select the phase of PMD channel.
  *   This parameter can be one of the following values:
  *   PMD_PHASE_U, PMD_PHASE_V, PMD_PHASE_W, PMD_PHASE_ALL.
  * @param  Output: Select the output.
  *   This parameter can be one of the following values:
  *   0: PMD_OUTPUT_L_L,  1: PMD_OUTPUT_L_H,        2: PMD_OUTPUT_H_L,
  *   3: PMD_OUTPUT_H_H,  4: PMD_OUTPUT_PWM_IPWM,
  *   5: PMD_OUTPUT_L_PWM/PMD_OUTPUT_L_IPWM/PMD_OUTPUT_IPWM_H,
  *   6: PMD_OUTPUT_PWM_L/PMD_OUTPUT_H_IPWM/PMD_OUTPUT_H_PWM,
  *   7: PMD_OUTPUT_PWM_IPWM.
  * @retval  Success or not
  *   The value returned can be one of the following values:
  *   SUCCESS or ERROR
  */
Result PMD_SetPortOutput(TSB_MTPD_TypeDef * PMDx, uint32_t PMDPhase, uint8_t Output)
{
    Result retval = ERROR;
    uint8_t fPOLHL = 0U;
    uint32_t value_PWM = 0U;
    uint32_t value_OC = 0U;
    uint32_t reg = 0U;

    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_PHASE(PMDPhase));
    assert_param(IS_PMD_OUTPUT(Output));

    /* Get the value of MTPDxMDPOT <POLH> and MTPDxMDPOT <POLL> */
    fPOLHL = (uint8_t) (PMDx->MDPOT >> 2U);
    fPOLHL &= 0x03U;

    value_PWM = (uint32_t) Output / 4U;
    reg = PMDx->MDOUT & t_MDOUTMask[PMDPhase];

    if ((fPOLHL == 3U) || (fPOLHL == 0U)) {
        fPOLHL >>= 1U;
        value_OC = (uint32_t) t_PMDPortOutput[fPOLHL][Output];
        value_PWM <<= 8U;
        if (PMDPhase == PMD_PHASE_ALL) {
            reg = value_OC | (value_OC << 2U) | (value_OC << 4U) |
                value_PWM | (value_PWM << 1U) | (value_PWM << 2U);
        } else {
            value_PWM <<= PMDPhase;
            PMDPhase <<= 1U;
            reg |= (value_PWM | (value_OC << PMDPhase));
        }
        PMDx->MDOUT = reg;
        retval = SUCCESS;
    } else {
        /* Do nothing */
    }
    return retval;
}

/**
  * @brief  Set the ADC trigger compare registers' value of the specified PMD channel. 
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0.
  * @param  TRGCMP0Timing: Value of ADC trigger compare register 0, from 0x0001 to [MDPRD set value ¨C 1].
  * @retval None.
  * @note MTPDxTRGCMP0 should be set in a range of 1 to [MDPRD set value ¨C 1].
  */
void PMD_SetTrgCmpValue(TSB_MTPD_TypeDef * PMDx, uint32_t TRGCMP0Timing)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_VALUE(TRGCMP0Timing));

    /* Set MTPDxTRGCMP0 <TRGCMP0> */
    PMDx->TRGCMP0 = TRGCMP0Timing;
}

/**
  * @brief  Set trigger mode of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0.
  * @param  PMDTrg: Select the PMD Trigger.
  *   This parameter can be one of the following values:
  *   PMD_ADC_TRG_0.
  * @param  Mode: PMD trigger mode.
  *   This parameter can be one of the following values:
  *   PMD_TRG_MODE_0, PMD_TRG_MODE_1, PMD_TRG_MODE_2, PMD_TRG_MODE_3,
  *   PMD_TRG_MODE_4, PMD_TRG_MODE_5, PMD_TRG_MODE_6, PMD_TRG_MODE_7.
  * @retval None.
  */
void PMD_SetTrgMode(TSB_MTPD_TypeDef * PMDx, uint32_t PMDTrg, uint32_t Mode)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_ADC_TRG(PMDTrg));
    assert_param(IS_PMD_TRG_MODE(Mode));

    /* Set MTPDxTRGCR <TRG0MD> to select trigger 0 mode */
    tmp = PMDx->TRGCR & PMD_TRGCR_TRG0MD_MASK;
    tmp |= (Mode << 0U);
    PMDx->TRGCR = tmp;
}

/**
  * @brief  Set trigger buffer update timing of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0.
  * @param  PMDTrg: Select the PMD Trigger.
  *   This parameter can be one of the following values:
  *   PMD_ADC_TRG_0.
  * @param  UpdateTiming: PMDTRG0 to PMDTRG1 buffer update timing.
  *   This parameter can be one of the following values:
  *   PMD_TRG_UPDATE_SYNC, PMD_TRG_UPDATE_ASYNC.
  * @retval None.
  */
void PMD_SetTrgUpdate(TSB_MTPD_TypeDef * PMDx, uint32_t PMDTrg, uint32_t UpdateTiming)
{
    uint32_t tmp = 0U;
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_PMD_ADC_TRG(PMDTrg));
    assert_param(IS_PMD_TRG_TIMING(UpdateTiming));

    /* Set MTPDxTRGCR <TRG0BE> to select trigger 0 buffer update timing */
    tmp = PMDx->TRGCR & PMD_TRGCR_TRG0BE_MASK;
    tmp |= (UpdateTiming << 3U);
    PMDx->TRGCR = tmp;

}

/**
  * @brief  Enable or disable trigger output in EMG protection state of the specified PMD channel.
  * @param  PMDx: Select the PMD channel.
  *   This parameter can be one of the following values:
  *   PMD0.
  * @param  NewState: Output enable in EMG protection state.
  *   This parameter can be one of the following values:
  *   ENABLE, DIABLE.
  * @retval None.
  */
void PMD_SetEMGTrg(TSB_MTPD_TypeDef * PMDx, FunctionalState NewState)
{
    /* Check the parameters */
    assert_param(IS_PMD_PERIPH(PMDx));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        PMDx->TRGMD |= PMD_TRGMD_EMGTGE_SET;
    } else {
        PMDx->TRGMD &= PMD_TRGMD_EMGTGE_CLEAR;
    }
}

/** @} */
/* End of group PMD_Exported_Functions */

/** @} */
/* End of group PMD */

/** @} */
/* End of group TX03_Periph_Driver */

#endif                          /* defined(__TMPM36B_PMD_H) */
